[
    {
        "id": 1,
        "nome": "Ada Lovelace",
        "descrição": "Diva da programação, já descrevia as operações lógicas de uma máquina mais de um século antes de existir o computador como entendemos hoje. Filha do romântico Lord Byron e confinada a uma sociedade que impedia que mulheres estudassem em universidades, Ada apaixonou-se pela matemática -- e era brilhante. Trocou intensamente cartas com Charles Babbage, idealizador da Máquina Analítica, e publicou artigos (assinados somente com suas iniciais) que expandiam as fronteiras do processamento de informação.",
        "leia mais": "https://www.programaria.org/como-ada-lovelace-filha-de-lord-byron-se-tornou-primeira-programadora-mundo/"
    },

    {
        "id": 2,
        "nome": "Dorothy Johnson Vaughan",
        "descrição": "Nascida no estado do Missouri, Dorothy Vaughan formou-se em Matemática e ingressou na NACA, agência que viria a se tornar a NASA, em 1943. Especializou-se em computação e seis anos depois chefiou um grupo composto somente por mulheres afro-americanas formadas em matemática. Dominava computação eletrônica, programação e o processo operacional da primeira máquina IBM usada pelo órgao governamental. Aposentou-se em 1971. Sua história é contada no filme 'Estrelas Além do Tempo'.",
        "leia mais": ""
    },

    {
        "id": 3,
        "nome": "Hedy Lamarr",
        "descrição": "Foi uma atriz e inventora austríaca radicada nos Estados Unidos. A sua mais significativa contribuição tecnológica deu-se durante a Segunda Guerra Mundial, tendo sido a sua co-invenção, juntamente com o compositor George Antheil, de um sistema de comunicações para as Forças Armadas dos Estados Unidos que serviu de base para a atual telefonia celular.",
        "leia mais": ""
    },

    {
        "id": 4,
        "nome": "Joan Clarke",
        "descrição": "Foi uma criptoanalista e numismata inglesa, mais conhecida pelo seu trabalho como decodificadora de mensagens nazistas durante a II Guerra Mundial que possibilitou salvar inúmeras vidas. Também foi amiga, confidente e ex-noiva de Alan Turing.",
        "leia mais": ""
    },

    {
        "id": 5,
        "nome": "Mary Winston Jackson",
        "descrição": "Mary Winston Jackson nasceu nos EUA e formou-se no Hampton Institute em 1942, onde estudou matemática e física. Foi autora e co-autora de diversos relatórios de pesquisa e destacou-se na NASA, onde começou a trabalhar em 1951. Para poder continuar seus experimentos na Insitituição, teve que cursar enegenharia, sendo a primeira mulher negra engenheira da Nasa. Pesquisou principalmente a camada limite de ar em torno de aviões e fez experimentos com túneis de vento. Sua história é contada no filme 'Estrelas Além do Tempo'",
        "leia mais": ""
    },

    {
        "id": 6,
        "nome": "Margaret Hamilton",
        "descrição": "É uma cientista da computação, engenheira de sistemas e empresária estadunidense. Foi diretora da Divisão de Software no Laboratório de Instrumentação do MIT, que desenvolveu o programa de vôo usado no projeto Apollo 11, a primeira missão tripulada à Lua. O software de Hamilton impediu que o pouso na Lua fosse abortado. Margaret publicou mais de 130 artigos, atas e relatórios relacionados aos 60 projetos e seis programas importantes nos quais ela esteve envolvida.",
        "leia mais": ""
    },

    {
        "id": 7,
        "nome": "Carol Shaw",
        "descrição": "Natural dos EUA, Carol é conhecida como a primeira mulher designer de games. Trabalhou na Atari, Tandem Computers e Activision. Seu cargo oficial na Atari era de Engenheira de Software e ela atuou no projeto Atari Basic Reference Manual. Na Activision, Carol criou seu jogo mais famoso, o River Raid. Entre outros jogos feitos por Carol estão Polo (não lançado), Happy Trails, Video Checkers, 3-D Tic-Tac-Toe, Super Breakout, Othello eHarbor Escape.",
        "leia mais": ""
    },

    {
        "id": 8,
        "nome": "Claúdia Maria Bauzer Medeiros",
        "descrição": "Doutora em Ciência da Computação pela Universidade de Waterloo (Canadá), Cláudia foi presidente da Sociedade Brasileira de Computação de 2004 a 2007. Atualmente é professora da Unicamp, onde fundou o Laboratory of Information Systems (LIS), e professora visitante da Universidade Paris-Dauphine, onde 2015 conquistou o título de Dr Honoris Causa. Tem diversos reconhecimentos internacionais por suas pesquisas e por fomentar a participação de mulheres na área de TI.",
        "leia mais": ""
    },

    {
        "id": 9,
        "nome": "Grace Hopper",
        "descrição": "Foi uma cientista da computação norte americana e Contra-almirante da Marinha dos Estados Unidos. Uma das primeiras programadoras do computador Harvard Mark I em 1944, inventou o primeiro compilador para uma linguagem de programação (que transforma um código de programação em código binário) e foi uma das pessoas que popularizou a ideia de linguagem de programação independente de máquina que levou ao desenvolvimento de COBOL, uma das primeiras linguagens de programação a se aproximar da linguagem humana.",
        "leia mais": ""
    }

]